---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.AssemblyMemberDifferentGeometry
source: html/6f2722af-1773-5de2-2bcb-1d9104b78500.htm
---
# AssemblyMemberDifferentGeometry Members

Specifies whether the .NET object represents a valid Revit entity.